Merge pull request #2 from BadriPrudhvi/feat/auto-execute-valid-queries
Feat/auto execute valid queries
